artillery/multi-tenant-load-test.yml
# ============================================================================
# ARTILLERY LOAD TESTING - Multi-Tenant API
# Semana 16 - Testing Integral
# ============================================================================

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 200
      name: "Spike"
  processor: "./functions.js"
  variables:
    tenantId: "test-tenant-uuid"

scenarios:
  # ===========================================================================
  # Scenario 1: Authentication Flow
  # ===========================================================================
  - name: "Auth Flow - Login + Protected Routes"
    weight: 30
    flow:
      - post:
          url: "/api/v2/auth/login"
          json:
            email: "test{{ $randomNumber(1, 1000) }}@testschool.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.tenant_id"
              as: "tenantId"

      - get:
          url: "/api/v2/students"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode: 200

  # ===========================================================================
  # Scenario 2: Multi-Tenant Data Access
  # ===========================================================================
  - name: "Multi-Tenant Data Isolation"
    weight: 40
    flow:
      - post:
          url: "/api/v2/auth/login"
          json:
            email: "admin@tenant1.com"
            password: "admin123"
          capture:
            - json: "$.token"
              as: "token1"
            - json: "$.user.tenant_id"
              as: "tenant1"

      - get:
          url: "/api/v2/students"
          headers:
            Authorization: "Bearer {{ token1 }}"
            X-Tenant-ID: "{{ tenant1 }}"

      - get:
          url: "/api/v2/grades"
          headers:
            Authorization: "Bearer {{ token1 }}"
            X-Tenant-ID: "{{ tenant1 }}"

      - get:
          url: "/api/v2/notifications"
          headers:
            Authorization: "Bearer {{ token1 }}"
            X-Tenant-ID: "{{ tenant1 }}"

  # ===========================================================================
  # Scenario 3: Real-Time Notifications
  # ===========================================================================
  - name: "Real-Time Notifications"
    weight: 20
    flow:
      - post:
          url: "/api/v2/auth/login"
          json:
            email: "user{{ $randomNumber(1, 100) }}@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
            - json: "$.user.tenant_id"
              as: "tenantId"

      - post:
          url: "/api/v2/notifications"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Tenant-ID: "{{ tenantId }}"
          json:
            userId: "{{ userId }}"
            title: "Load Test Notification"
            message: "Testing notification system"
            type: "info"

  # ===========================================================================
  # Scenario 4: Collaborative Editing
  # ===========================================================================
  - name: "Collaborative Document Editing"
    weight: 10
    flow:
      - post:
          url: "/api/v2/auth/login"
          json:
            email: "editor@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.tenant_id"
              as: "tenantId"

      - post:
          url: "/api/v2/documents"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Tenant-ID: "{{ tenantId }}"
          json:
            title: "Load Test Document"
            content: "Initial content"
            type: "text"
          capture:
            - json: "$.id"
              as: "documentId"

      - post:
          url: "/api/v2/documents/{{ documentId }}/operations"
          headers:
            Authorization: "Bearer {{ authToken }}"
            X-Tenant-ID: "{{ tenantId }}"
          json:
            type: "insert"
            position: 0
            content: "New text "
            version: 1

# ===========================================================================
# Expected Results
# ===========================================================================
# - Response time p95 < 500ms
# - Response time p99 < 1000ms
# - Error rate < 1%
# - Concurrent users: 100+
# - Requests per second: 200+